darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
  sleep_init();
  sleep_load_persistent(persist);
#ifdef SLEEP_MODE_CONTINUOUS
  persist.wakeupCount++;
  sleep_save_persistent(persist);
#endif

  // v5.0.4: восстанавливаем lastReportWeight из EEPROM (RTC RAM теряется при reset/прошивке).
  // Без этого после каждой перезагрузки первый отчёт шёл без дельты "С прошлого замера".
  {
    float savedReportW = 0.0f;
    if (load_last_report(savedReportW)) {
      persist.lastReportWeight = savedReportW;
      persist.hasLastReport = true;
    }
  }

  // v5.0.5: восстанавливаем lastTempC из EEPROM (fallback для отчётов когда
  // DS18B20 не успел прочитаться к моменту отправки после wake-up).
  {
    float savedTempC = 0.0f;
    if (load_last_temp(savedTempC)) {
      persist.lastTempC = savedTempC;
    }
  }

  lcd_init(lcd);

#ifdef LEGACY_HX711_PINS
  // Старая распиновка использует TX (GPIO1) как HX711 SCK.
  // Закрываем Serial чтобы не было UART-мусора на линии clock.
  Serial.flush();
  Serial.end();
#endif
  scale_init(scale, DT_PIN, SCK_PIN);
  sys.sensorReady = check_sensor(scale);

  bool rtcOk = rtc_init();

  if (!temp_init()) {
    Serial.println(F("[Temp] No sensor, readings disabled"));
  }

  load_calibration_data(sys.calibrationFactor, sys.offset, sys.lastSavedWeight);
  sys.prevOffset = load_prev_offset();
  web_settings_init();
  ext_settings_init();
  sched_settings_init();
  tg_report_settings_init();
  tg_settings_init();
  credentials_init();
  // prevWeight при загрузке из EEPROM addr 30 (эталон пользователя).
  // Fallback на lastSavedWeight если EEPROM addr 30 ещё не записан.
  sys.prevWeight = load_prev_weight(sys.lastSavedWeight);

  bat_init();

  if (sys.sensorReady) {
    scale.set_scale(sys.calibrationFactor);
    scale.set_offset(sys.offset);
  }

  yield();
  sys.wifiOk = wifi_init();  // Инициализация WiFi (AP или STA режим)
  yield();

  yield();
  show_splash_screen();
  yield();
  if (sys.wifiOk) {
    Serial.println(F("[WiFi] Connected"));
    Serial.print(F("[WiFi] IP: "));
    Serial.println(WiFi.status() == WL_CONNECTED ? WiFi.localIP() : WiFi.softAPIP());
    if (get_wifi_mode() == 1) {
      ntp_sync_time();  // Синхронизация времени (только в STA режиме)
    }
    start_webserver();
    // ArduinoOTA — обновление прошивки по воздуху. Пароль хранится в EEPROM,
    // дефолт "ota_beehive" при пустом блоке credentials (UI показывает warning).
    ArduinoOTA.setHostname("beehivescale");
    {
      char otaPassBuf[32];
      get_ota_pass(otaPassBuf, sizeof(otaPassBuf));
      ArduinoOTA.setPassword(otaPassBuf);
    }
    ArduinoOTA.onStart([]() { lastActivityTime = millis(); });
    ArduinoOTA.onProgress([](unsigned int, unsigned int) { lastActivityTime = millis(); });
    ArduinoOTA.begin();
  } else {
    Serial.println(F("[WiFi] Initialization failed!"));
  }

  log_init();
  lastActivityTime = millis();
#if defined(ESP8266)
  ESP.wdtEnable(8000);  // Включаем программный WDT обратно: 8 сек
#endif

  // Сбросить ISR-флаги кнопок: при boot D3 (GPIO0) и D4 (GPIO2) — boot-strap пины,
  // на них происходят переходные процессы → FALLING-прерывания ловят ложные нажатия.
  // Чистим флаги перед стартом loop, чтобы не было автотарирования при включении.
  noInterrupts();
  btnMain.irqFell = false;
  btnMain.irqTime = 0;
  btnMenu.irqFell = false;
  btnMenu.irqTime = 0;
  interrupts();

  Serial.println(F("[Setup] Done"));
}

void start_webserver() {
  if (webServerStarted) return;

  WebData wd;
  wd.weight          = &sys.smoothedWeight;
  wd.lastSavedWeight = &sys.lastSavedWeight;
  wd.tempC           = &sys.tempData.temperature;
  // humidity поле убрано (пункт 22) — нет физического датчика.
  wd.rtcTempC        = &sys.rtcTempC;
  wd.calibFactor     = &sys.calibrationFactor;
  wd.offset          = &sys.offset;
  wd.sensorReady     = &sys.sensorReady;
  wd.wifiOk          = &sys.wifiOk;
  wd.datetime        = &sys.datetimeStr;
  wd.wakeupCount     = &persist.wakeupCount;
  wd.batVoltage      = &sys.batVoltage;
  wd.batPercent      = &sys.batPercent;
  wd.prevWeight      = &sys.prevWeight;
  wd.lastReportWeight = &persist.lastReportWeight;
  wd.hasLastReport    = &persist.hasLastReport;

  WebActions wa;
  wa.doTare = perform_taring;
  wa.doSave = []() {
    sys.prevWeight = sys.smoothedWeight;
    save_weight(sys.lastSavedWeight, sys.smoothedWeight);
    save_prev_weight(sys.prevWeight);
    // Сохраняем дату фиксации (для UI "зафикс. от ДД.ММ.ГГГГ")
    TimeStamp ts = rtc_now();
    if (ts.valid) {
      DateTime dt(ts.year, ts.month, ts.day, ts.hour, ts.minute, ts.second);
      save_prev_weight_date(dt.unixtime());
    }
  };
  wa.onActivity = []() { lcd_backlight_activity(lcd); };
  wa.doSetCalibFactor = [](float cf) {
    sys.calibrationFactor = cf;
    scale.set_scale(cf);
    save_calibration(cf);
  };
  wa.doSetCalibOffset = [](long ofs) {
    sys.offset = ofs;
    scale.set_offset(ofs);
    save_offset(ofs);
  };

  webserver_init(wd, wa);
  webServerStarted = true;
}

void loop() {
  app_wdt_reset();
  if (sys.wifiOk) {
    ArduinoOTA.handle();
#if defined(ESP8266)
    MDNS.update();
#endif
  }
  static unsigned long lastTempRead   = 0;
  static unsigned long lastTsUpload   = 0;
  static unsigned long lastTgReport   = millis();
  static unsigned long lastBatRead    = 0;
  static unsigned long lastLogWrite   = 0;
  static unsigned long lastSensorChk  = 0;  // фича 14: watchdog HX711
  static int           sensorFailCnt  = 0;
  unsigned long now = millis();

  if (now - lastTempRead >= TEMP_READ_INTERVAL_MS) {
    if (temp_available()) {
      process_temperature();
    }
    sys.currentTime = rtc_now();
    sys.rtcTempC = rtc_temperature();
    // Обновляем datetimeStr сразу после RTC-чтения, чтобы log_append ниже
    // использовал актуальное время (не из прошлой итерации цикла).
    if (sys.currentTime.valid) {
      sys.datetimeStr = rtc_format_datetime(sys.currentTime);
    } else {
      // RTC недоступен — используем uptime как fallback, чтобы запись в лог не блокировалась
      unsigned long sec = millis() / 1000;
      char tb[20];
      snprintf(tb, sizeof(tb), "01.01.2020 %02lu:%02lu:%02lu",
               (sec / 3600) % 24, (sec / 60) % 60, sec % 60);
      sys.datetimeStr = tb;
    }
    lastTempRead = now;
    sys.needsRedraw = true;
  }

  if (now - lastBatRead >= BAT_READ_INTERVAL_MS) {
    sys.batVoltage = bat_voltage();
    sys.batPercent  = bat_percent();
    lastBatRead = now;
    sys.needsRedraw = true;
  }

  handle_buttons();
  process_weight();

