darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
  // Auto-return на главный экран (1/8) если 20 сек никто не трогал кнопки.
  // Не применяется на экранах 6 (calib menu) и 7 (diag) — там пользователь работает с интерфейсом.
  static const unsigned long AUTO_HOME_MS = 20000UL;
  if (sys.menuScreen != 0 && sys.menuScreen != 6 && sys.menuScreen != 7
      && (millis() - lastActivityTime) > AUTO_HOME_MS) {
    sys.menuScreen = 0;
    sys.needsRedraw = true;
  }

  update_interface();

  // ── Фича 14: Watchdog HX711 — авто-перезапуск датчика при зависании ──
  if (now - lastSensorChk >= 5000UL) {
    lastSensorChk = now;
    if (!scale.is_ready()) {
      sensorFailCnt++;
      if (sensorFailCnt >= 6) {  // 6 × 5с = 30с без ответа → перезапуск
        Serial.println(F("[HX711] Watchdog: reinit"));
        scale_init(scale, DT_PIN, SCK_PIN);
        sys.sensorReady = check_sensor(scale);
        if (sys.sensorReady) {
          scale.set_scale(sys.calibrationFactor);
          scale.set_offset(sys.offset);
          sys.emaInitialized = false;
          sys.smoothedWeight = 0.0f;
          Serial.println(F("[HX711] Recovered"));
        }
        sensorFailCnt = 0;
      }
    } else {
      sensorFailCnt = 0;
      if (!sys.sensorReady) {
        sys.sensorReady = true;
        sys.needsRedraw = true;
      }
    }
  }

  // В deep sleep режиме лог пишется один раз перед сном (ниже), здесь пропускаем
#ifndef SLEEP_MODE_DEEP_SLEEP
  {
    static uint16_t _lastSchedLogMin = 0xFFFF;
    static bool _bootLogDone = false;
    uint16_t stimes[8]; uint8_t scnt;
    get_sched_times(stimes, scnt);
    bool schedLog = false;
    if (sys.currentTime.valid && scnt > 0) {
      uint16_t cur_min = (uint16_t)sys.currentTime.hour * 60 + sys.currentTime.minute;
      for (uint8_t i = 0; i < scnt; i++) {
        if (stimes[i] == cur_min && _lastSchedLogMin != cur_min) {
          _lastSchedLogMin = cur_min; schedLog = true; break;
        }
      }
    }
    // Запись при каждом включении (однократно, как только датчик готов)
    bool bootLog = false;
    if (!_bootLogDone && sys.sensorReady && sys.currentTime.valid) {
      _bootLogDone = true;
      if (!schedLog) {  // не дублировать если это уже расписанное время
        bootLog = true;
        // предотвратить повторное срабатывание schedLog в эту же минуту
        if (sys.currentTime.valid)
          _lastSchedLogMin = (uint16_t)sys.currentTime.hour * 60 + sys.currentTime.minute;
      }
    }
    bool useInterval = (scnt == 0);  // интервал только если расписание не задано
    if (schedLog || bootLog || (useInterval && now - lastLogWrite >= LOG_INTERVAL_MS)) {
      log_append(sys.datetimeStr, sys.smoothedWeight,
                 sys.tempData.temperature, sys.tempData.humidity, sys.batVoltage, sys.batPercent);
      // При срабатывании расписания — ставим флаг отправки TG-отчёта.
      // Это решает проблему "ESP спит между расписаниями": каждое запланированное
      // пробуждение в 09:00, 14:00, 21:00 → одна отправка в Telegram с весом и дельтой.
      if (schedLog) tgReportPending = true;
      lastLogWrite = now;
    }
  }
#endif

  lcd_backlight_tick(lcd, get_lcd_bl_sec());

  wifi_ensure_connected();
  // Определяем "эффективный" режим WiFi по факту, а не из EEPROM:
  // если STA-подключение упало и wifi_init() сделал fallback на AP, EEPROM остаётся в STA,
  // но реально работаем в AP. Без этой проверки веб-сервер останавливается через 7 сек.
  bool isApMode = (get_wifi_mode() == 0) || (WiFi.getMode() == WIFI_AP);
  if (isApMode) {
    sys.wifiOk = (WiFi.softAPIP() != IPAddress(0,0,0,0));
  } else {
    sys.wifiOk = (WiFi.status() == WL_CONNECTED);
    if (!sys.wifiOk && webServerStarted) {
      // Корректно останавливаем web-сервер перед сбросом флага — иначе при
      // реконнекте повторный _srv.begin() поверх живого слушающего сокета
      // может вести к утечкам / двойным handlers (пункт 7).
      webserver_stop();
      webServerStarted = false;
    }
    ntp_loop();
  }

  if (sys.wifiOk && !webServerStarted) {
    start_webserver();
  }

  if (sys.wifiOk && webServerStarted) {
    webserver_handle();
    static unsigned long lastQueueProc = 0;
    if (now - lastQueueProc >= 60000UL) {
      queue_process();
      lastQueueProc = now;
    }
  }

  if (get_wifi_mode() == 1 && sys.wifiOk) {
    if (now - lastTsUpload >= TS_UPDATE_INTERVAL_MS) {
      float rtcT = rtc_temperature();
      if (!ts_send(sys.smoothedWeight, sys.tempData.temperature,
                   sys.tempData.humidity, rtcT)) {
        queue_add(sys.smoothedWeight, sys.tempData.temperature, 
                  sys.tempData.humidity, rtcT, sys.datetimeStr);
      }
      lastTsUpload = now;
    }

    // Отправка TG-отчёта в двух случаях:
    // 1. Сработало расписание (tgReportPending=true) — отправляем сразу в это пробуждение
    // 2. Расписания нет, и просто прошёл интервал (для непрерывного режима без расписания)
    uint32_t tgRptMs = get_tg_report_interval_min() * 60000UL;
    uint8_t schedCnt = 0; { uint16_t st[8]; get_sched_times(st, schedCnt); }
    bool doTgReport = false;
    if (tgReportPending) {
      doTgReport = true;
    } else if (schedCnt == 0 && tgRptMs > 0 && now - lastTgReport >= tgRptMs) {
      doTgReport = true;
    }
    if (doTgReport) {
      TimeStamp ts = rtc_now();
      String dt = rtc_format_datetime(ts);

      // v5.0.5: гарантируем актуальную температуру перед отправкой отчёта.
      // После deep-sleep wake-up DS18B20 часто не успевает прочитаться через async
      // process_temperature() — первое чтение всегда пропускается (power-on 85°C),
      // а отчёт уходит в первые 5-10 сек. Делаем синхронный force-read (~750мс).
      // Если всё равно невалидно — fallback на persist.lastTempC (последняя сохранённая).
      float reportTempC = sys.tempData.temperature;
      if (reportTempC <= -90.0f && temp_available()) {
        TempData fresh = temp_force_read();
        if (fresh.valid) {
          sys.tempData = fresh;
          reportTempC = fresh.temperature;
        }
      }
      if (reportTempC <= -90.0f && persist.lastTempC > -90.0f) {
        reportTempC = persist.lastTempC;  // fallback на старое валидное значение
      }

      if (tg_send_report(sys.smoothedWeight, reportTempC,
                         sys.tempData.humidity, dt,
                         sys.prevWeight, load_prev_weight_date(),
                         persist.lastReportWeight, persist.hasLastReport)) {
        tgReportPending = false;
        lastTgReport = now;
        // После успешной отправки: текущий вес становится "вчерашним" для следующего отчёта.
        persist.lastReportWeight = sys.smoothedWeight;
        persist.hasLastReport = true;
        if (reportTempC > -90.0f) persist.lastTempC = reportTempC;
        sleep_save_persistent(persist);
        // v5.0.4: дублируем reportWeight в EEPROM, чтобы дельта не пропадала после reset/прошивки.
        save_last_report(sys.smoothedWeight, true);
        // v5.0.5: то же для температуры — fallback после reset.
        if (reportTempC > -90.0f) save_last_temp(reportTempC);
      }
      // если не отправилось (нет WiFi, нет токена) — флаг остаётся, попробуем позже
    }
  }

  check_auto_sleep();

#ifdef SLEEP_MODE_DEEP_SLEEP
  {
    log_append(sys.datetimeStr, sys.smoothedWeight,
               sys.tempData.temperature, sys.tempData.humidity, sys.batVoltage, sys.batPercent);
  }
  persist.lastWeight = sys.smoothedWeight;
  persist.lastTempC = sys.tempData.temperature;
  persist.wakeupCount++;
  sleep_save_persistent(persist);
#if defined(ESP32)
  esp_task_wdt_delete(NULL);
#endif
  uint32_t sleepDur = sys.currentTime.valid
    ? sched_next_sec(sys.currentTime.hour, sys.currentTime.minute)
    : get_sleep_sec();
  // Guard: sched_next_sec() может вернуть 0 в пограничном случае ровно на минуте расписания.
  // Минимум 60 сек чтобы ESP не циклил "проснулся-уснул".
  if (sleepDur < 60) sleepDur = 60;
  Serial.print(F("[Sleep] Sleep for "));
  Serial.print(sleepDur);
  Serial.println(F(" sec"));
  sleep_enter(sleepDur);
#endif
}

void handle_buttons() {
  // Boot grace period: первые 2 секунды после старта игнорируем кнопки.
  // На ESP8266 это критично из-за boot-strap пинов GPIO0/2; на ESP32 (GPIO27/26 — RTC)
  // таких проблем нет, но небольшой grace всё равно защищает от наводок при инициализации I2C/WiFi.
  if (millis() < 2000UL) {
    // На всякий случай ещё раз чистим ISR-флаги
    noInterrupts();
    btnMain.irqFell = false;
    btnMenu.irqFell = false;
    interrupts();
    return;
  }

  // Wake-press guard: после boot / deep-sleep-wake кнопка часто ещё физически удерживается
  // (пользователь только что её нажал, чтобы разбудить). Если начать считать удержание прямо
  // отсюда, через ~3.5 сек реального удержания сработает MEDIUM_PRESS → выскочит диалог тары
  // сам по себе. Поэтому игнорируем MAIN-кнопку до её первого release. Pressing-цикл начнёт
  // считаться только со следующего, "осознанного" нажатия.
  static bool waitFirstReleaseMain = true;
  if (waitFirstReleaseMain) {
    if (digitalRead(BUTTON_PIN) == HIGH) {
      waitFirstReleaseMain = false;
      noInterrupts();
      btnMain.irqFell = false;
      interrupts();
      btnMain.lastRaw = false;
      btnMain.isPressed = false;
      btnMain.longFired = false;
    } else {
      // Кнопка ещё держится с момента wake — поддерживаем подсветку и выходим.
      lastActivityTime = millis();
      lcd_backlight_activity(lcd);
      return;
    }
  }

