darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
  float alpha = web_get_ema_alpha();
  if (!sys.emaInitialized) {
    sys.smoothedWeight = raw;
    sys.emaInitialized = true;
  } else {
    sys.smoothedWeight = alpha * raw + (1.0f - alpha) * sys.smoothedWeight;
  }

  // --- Авто-фиксация стабильных показаний ---
  stableBuf[stableBufIdx] = sys.smoothedWeight;
  stableBufIdx = (stableBufIdx + 1) % STABLE_BUF_SIZE;
  if (stableBufCnt < STABLE_BUF_SIZE) stableBufCnt++;

  bool wasStable = sys.weightStable;
  if (stableBufCnt >= STABLE_BUF_SIZE) {
    float mn = stableBuf[0], mx = stableBuf[0];
    for (int i = 1; i < STABLE_BUF_SIZE; i++) {
      if (stableBuf[i] < mn) mn = stableBuf[i];
      if (stableBuf[i] > mx) mx = stableBuf[i];
    }
    sys.weightStable = (mx - mn) < STABLE_THR;
  } else {
    sys.weightStable = false;
  }

  if (sys.weightStable && !stableSaved) {
    unsigned long nowMs = millis();
    // При первой стабилизации в сессии:
    // 1) prevWeight — если не установлен (первый запуск), ставим текущий
    // 2) lastSavedWeight — сохраняем ВСЕГДА если вес изменился (не только при 0).
    //    Это позволяет следующей сессии знать "что было", даже если весы включали
    //    менее чем на 5 минут. prevWeight НЕ трогаем — он остаётся эталоном boot.
    if (sys.smoothedWeight > 0.1f) {
      if (sys.prevWeight < 0.1f) {
        sys.prevWeight = sys.smoothedWeight;
        save_prev_weight(sys.prevWeight);
        sys.needsRedraw = true;
      }
      if (fabsf(sys.smoothedWeight - sys.lastSavedWeight) > WEIGHT_SAVE_THR) {
        save_weight(sys.lastSavedWeight, sys.smoothedWeight);
        lastSaveTime = nowMs;
      }
    }
    if (nowMs - lastStableSaveTime >= STABLE_SAVE_MIN_MS) {
      save_weight(sys.lastSavedWeight, sys.smoothedWeight);
      // prevWeight НЕ обновляем — он меняется только вручную ("Сохранить" в веб)
      // или при первом запуске (auto-init выше). lastSavedWeight уже сохранён
      // при первой стабилизации сессии, поэтому следующий boot получит правильный
      // эталон без сброса дельты каждые 10 минут.
      stableSaved = true;
      lastStableSaveTime = nowMs;
      lastSaveTime = nowMs;
    } else {
      stableSaved = true;  // не писать в EEPROM, но флаг ставим
    }
  }
  if (!sys.weightStable) {
    stableSaved = false;
  }
  if (sys.weightStable != wasStable) {
    sys.needsRedraw = true;
  }
  // --- конец авто-фиксации ---

  float delta = fabsf(sys.smoothedWeight - sys.lastSavedWeight);
  unsigned long now = millis();
  if (delta > WEIGHT_SAVE_THR && now - lastSaveTime >= WEIGHT_SAVE_MS) {
    save_weight(sys.lastSavedWeight, sys.smoothedWeight);
    lastSaveTime = now;
    sys.needsRedraw = true;
  }

  // Периодическая запись prevWeight в EEPROM (раз в 5 мин, только если изменился и валиден)
  if (sys.prevWeight >= 0.1f &&
      (isnan(lastSavedPrevWeight) || fabsf(lastSavedPrevWeight - sys.prevWeight) > 0.001f)) {
    if (now - lastPrevWeightSave >= 5UL * 60UL * 1000UL) {
      save_prev_weight(sys.prevWeight);
      lastSavedPrevWeight = sys.prevWeight;
      lastPrevWeightSave  = now;
    }
  }

  if (get_wifi_mode() == 1) {
    static unsigned long lastAlertTime = 0;
    static const unsigned long ALERT_COOLDOWN_MS = 1800000UL;  // 30 мин между алертами
    float alertDelta = web_get_alert_delta();
    float deltaFromRef   = fabsf(sys.smoothedWeight - sys.prevWeight);
    float deltaFromAlert = fabsf(sys.smoothedWeight - persist.lastAlertWeight);
    bool firstAlert  = !persist.alertSent && deltaFromRef   >= alertDelta;
    bool repeatAlert =  persist.alertSent && deltaFromAlert >= alertDelta;
    bool cooldownOk  = (now - lastAlertTime >= ALERT_COOLDOWN_MS);
    if ((firstAlert || repeatAlert) && sys.wifiOk && cooldownOk) {
      TimeStamp ts = rtc_now();
      tg_send_alert(sys.smoothedWeight, sys.tempData.temperature,
                    rtc_format_datetime(ts));
      persist.alertSent    = true;
      persist.lastAlertWeight = sys.smoothedWeight;
      lastAlertTime = now;
    }
    // Сбрасываем флаг когда вес вернулся близко к эталону
    if (deltaFromRef < alertDelta * 0.5f) {
      persist.alertSent    = false;
      persist.lastAlertWeight = sys.prevWeight;
    }
  }
}

void process_temperature() {
  TempData td = temp_read();
  if (td.valid) {
    sys.tempData = td;  // обновляем только при успешном чтении
  }
  // При ошибке CRC — сохраняем предыдущее валидное значение
}

void show_screen_num(int n);  // forward declaration

void update_interface() {
  if (!sys.needsRedraw) return;
  if (sys.menuScreen != sys.lastMenuScreen) {
    lcd.clear();
    if (sys.lastMenuScreen == 7) diagDone = false;  // сброс диагностики при уходе
    sys.lastMenuScreen = sys.menuScreen;
  }
  if (sys.sensorReady) {
    switch (sys.menuScreen) {
      case 0: display_screen_weight();     break;
      case 1: display_screen_diff();       break;
      case 2: display_screen_battery();    break;
      case 3: display_screen_temp();       break;
      case 4: display_screen_datetime();   break;
      case 5: display_screen_status();     break;
      case 6: display_screen_calib_menu(); break;
      case 7: display_screen_diag();       break;
    }
    // Номер экрана в правом углу строки 2 (экраны 6,7 — особый формат)
    if (sys.menuScreen < 6) {
      show_screen_num(sys.menuScreen);
    }
  } else {
    display_error();
  }
  sys.needsRedraw = sys.sensorReady ? false : true;  // мигать пока ошибка
}

// Показывает номер экрана "N/7" в позиции 13 строки 1
void show_screen_num(int n) {
  char buf[8];
  snprintf(buf, sizeof(buf), "%d/%d", n + 1, MENU_SCREENS);
  lcd.setCursor(13, 1);
  lcd.print(buf);
}

void display_screen_weight() {
  char buf[24];
  lcd.setCursor(0, 0);
  snprintf(buf, sizeof(buf), "Ves:%6.2f%ckg", sys.smoothedWeight, sys.weightStable ? '*' : ' ');
  lcd_print_padded(lcd, buf);
  lcd.setCursor(0, 1);
  if (sys.currentTime.valid) {
    snprintf(buf, sizeof(buf), "%02u:%02u:%02u %s",
             sys.currentTime.hour, sys.currentTime.minute, sys.currentTime.second,
             sys.wifiOk ? " W" : "  ");
  } else {
    snprintf(buf, sizeof(buf), "No RTC     %s", sys.wifiOk ? " W" : "  ");
  }
  lcd_print_padded(lcd, buf);
}

void display_screen_temp() {
  char buf[24];
  lcd.setCursor(0, 0);
  if (sys.tempData.valid) {
    if (isnan(sys.rtcTempC)) snprintf(buf, sizeof(buf), "T:%.1fC  R:---", sys.tempData.temperature);
    else snprintf(buf, sizeof(buf), "T:%.1fC R:%.1fC", sys.tempData.temperature, sys.rtcTempC);
  } else {
    if (isnan(sys.rtcTempC)) snprintf(buf, sizeof(buf), "T:---   R:---");
    else snprintf(buf, sizeof(buf), "T:---  R:%.1fC", sys.rtcTempC);
  }
  lcd_print_padded(lcd, buf);

