darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
      lcd.setCursor(0, 1);
      snprintf(buf, sizeof(buf), "Ves:%6.2fkg", liveWeight);
      lcd_print_padded(lcd, buf);
    }

    // Чтение кнопок (мастер adjust_calibration: внутри своего таймминга,
    // MEDIUM не используем; LONG для MAIN=сохранить, MENU=минус-шаг)
    ButtonAction actMain = read_button(BUTTON_PIN,   btnMain, 0UL, 2000UL);
    ButtonAction actMenu = read_button(MENU_BTN_PIN, btnMenu, 0UL, 1000UL);

    if (actMain == SHORT_PRESS) {
      // Переключить шаг: 10 → 1 → 0.1 → 10 ...
      stepIdx = (stepIdx + 1) % 3;
      lastWeighTime = 0;  // форсировать перерисовку
    }

    if (actMenu == SHORT_PRESS) {
      // CF + шаг
      cf = constrain(cf + steps[stepIdx], 100.0f, 50000.0f);
      scale.set_scale(cf);
      lastWeighTime = 0;
    }

    if (actMenu == LONG_PRESS) {
      // CF − шаг
      cf = constrain(cf - steps[stepIdx], 100.0f, 50000.0f);
      scale.set_scale(cf);
      lastWeighTime = 0;
    }

    if (actMain == LONG_PRESS) {
      // Сохранить и выйти
      cf = constrain(cf, 100.0f, 50000.0f);
      sys.calibrationFactor = cf;
      scale.set_scale(cf);
      save_calibration(cf);
      sys.emaInitialized = false;

      lcd.clear();
      lcd.setCursor(0, 0); lcd_print_padded(lcd, "Sokhraneno!     ");
      snprintf(buf, sizeof(buf), "CF:%.1f", cf);
      lcd.setCursor(0, 1); lcd_print_padded(lcd, buf);
      { unsigned long _t0=millis(); while(millis()-_t0<1500UL){app_wdt_reset();yield();} }
      sys.needsRedraw = true;
      lastActivityTime = millis();
      Serial.print(F("[AdjCal] Saved CF=")); Serial.println(cf, 1);
      return;
    }

    yield();
  }
  // Restore CF after timeout (break exits without saving)
  scale.set_scale(sys.calibrationFactor);
  sys.emaInitialized = false;
  sys.needsRedraw = true;
}

void display_error() {
  static bool blink = false;
  static unsigned long lastBlink = 0;
  unsigned long _nb = millis();
  if (_nb - lastBlink >= 500UL) {
    blink = !blink;
    lastBlink = _nb;
  }
  lcd.setCursor(0, 0);
  lcd_print_padded(lcd, blink ? "*** OSHIBKA! ***" : "                ");
  lcd.setCursor(0, 1);
  lcd_print_padded(lcd, "Check HX711 wire");
}

void perform_taring() {
  Serial.println(F("[Tare] Start"));

  // Сохраняем предыдущий offset для возможности отмены
  sys.prevOffset = sys.offset;
  sys.hasPrevOffset = true;
  save_prev_offset(sys.prevOffset);

  lcd.clear();
  lcd.setCursor(0, 0); lcd_print_padded(lcd, " Tarirovka...   ");
  lcd.setCursor(0, 1); lcd_print_padded(lcd, " Podozhdite...  ");

  // Пауза 1.5 сек — дать датчику успокоиться после нажатия кнопки
  { unsigned long _t=millis(); while(millis()-_t<1500UL){app_wdt_reset();yield();} }
  app_wdt_reset();

  // Проверяем готовность датчика перед тарированием
  if (!scale.wait_ready_timeout(3000)) {
    lcd.clear();
    lcd.setCursor(0, 0); lcd_print_padded(lcd, "Tara: OSHIBKA!  ");
    lcd.setCursor(0, 1); lcd_print_padded(lcd, "HX711 ne otvech.");
    { unsigned long _t0=millis(); while(millis()-_t0<2000UL){app_wdt_reset();yield();} }
    sys.needsRedraw = true;
    return;
  }

  // Ручной tare с yield — вместо блокирующего scale.tare(30) который вызывал WDT reset
  {
    long sum = 0;
    const int TARE_SAMPLES = 20;
    for (int i = 0; i < TARE_SAMPLES; i++) {
      if (!scale.wait_ready_timeout(500)) continue;
      sum += scale.read();
      app_wdt_reset();
      yield();
    }
    scale.set_offset(sum / TARE_SAMPLES);
  }
  sys.offset = scale.get_offset();
  sys.smoothedWeight = 0.0f;
  sys.emaInitialized = false;
  save_offset(sys.offset);

  char _ofs[17]; snprintf(_ofs, sizeof(_ofs), "Ofs:%ld", sys.offset);
  lcd.clear();
  lcd.setCursor(0, 0); lcd_print_padded(lcd, "Tara: OK        ");
  lcd.setCursor(0, 1); lcd_print_padded(lcd, _ofs);
  app_wdt_reset();
  { unsigned long _t0=millis(); while(millis()-_t0<1200UL){app_wdt_reset();yield();} }
  sys.needsRedraw = true;
  Serial.print(F("[Tare] Offset=")); Serial.println(sys.offset);
}

void undo_tare() {
  if (!sys.hasPrevOffset) {
    lcd.clear();
    lcd.setCursor(0, 0); lcd_print_padded(lcd, "Tara: net       ");
    lcd.setCursor(0, 1); lcd_print_padded(lcd, "predydushchej   ");
    { unsigned long _t0=millis(); while(millis()-_t0<1200UL){app_wdt_reset();yield();} }
    sys.needsRedraw = true;
    return;
  }

  Serial.println(F("[Tare] Undo"));
  sys.offset = sys.prevOffset;
  scale.set_offset(sys.offset);
  save_offset(sys.offset);
  sys.emaInitialized = false;
  sys.smoothedWeight = 0.0f;

  lcd.clear();
  lcd.setCursor(0, 0); lcd_print_padded(lcd, "Tara: Otmena    ");
  char _ofs[17]; snprintf(_ofs, sizeof(_ofs), "Ofs:%ld", sys.offset);
  lcd.setCursor(0, 1); lcd_print_padded(lcd, _ofs);
  app_wdt_reset();
  { unsigned long _t0=millis(); while(millis()-_t0<1200UL){app_wdt_reset();yield();} }
  sys.needsRedraw = true;
  Serial.print(F("[Tare] Restored offset=")); Serial.println(sys.offset);
}

void perform_calibration() {
  Serial.println(F("[Calib] Start"));

  auto wait_press = [](int pin, uint32_t timeout_ms) -> bool {
    unsigned long t = millis();
    while (digitalRead(pin) == HIGH) {
      app_wdt_reset(); yield();
      if (millis() - t > timeout_ms) return false;
    }
    // Ждём отпускание кнопки (с таймаутом от залипания)
    unsigned long t2 = millis();
    while (digitalRead(pin) == LOW) {
      app_wdt_reset(); yield();
      if (millis() - t2 > 10000UL) return false;  // 10с таймаут на залипание
    }
    return true;
  };

  lcd.clear();
  lcd.setCursor(0, 0); lcd_print_padded(lcd, "Ubrat gruz!     ");
  lcd.setCursor(0, 1); lcd_print_padded(lcd, "Zhmi knopku...  ");
  unsigned long start = millis();
  while (digitalRead(BUTTON_PIN) == LOW) {
    app_wdt_reset(); yield();
    if (millis() - start > 10000) { sys.needsRedraw = true; lastActivityTime = millis(); return; }
  }
  if (!wait_press(BUTTON_PIN, 30000)) { sys.needsRedraw = true; lastActivityTime = millis(); return; }

  // Проверяем HX711 перед тарированием
  if (!scale.wait_ready_timeout(3000)) {
    lcd.clear();
    lcd.setCursor(0, 0); lcd_print_padded(lcd, "OSHIBKA HX711!  ");
    lcd.setCursor(0, 1); lcd_print_padded(lcd, "Proverte provod!");
    { unsigned long _t0=millis(); while(millis()-_t0<2000UL){app_wdt_reset();yield();} }
    sys.needsRedraw = true; lastActivityTime = millis();
    return;
  }

  // Тарируем с scale=1 чтобы get_units вернул сырые единицы АЦП
  scale.set_scale(1.0f);
  // Пауза перед tare — датчик должен успокоиться
  { unsigned long _t=millis(); while(millis()-_t<500UL){app_wdt_reset();yield();} }
  // Диагностика: два подряд чтения — должны быть похожи но НЕ одинаковы
  long dbgA = scale.read();
  long dbgB = scale.read();
  Serial.print(F("[Calib] read1=")); Serial.print(dbgA);
  Serial.print(F(" read2=")); Serial.println(dbgB);
  if (dbgA == dbgB) {
    Serial.println(F("[Calib] WARNING: HX711 stuck! Power cycling..."));
    scale.power_down();
    delayMicroseconds(100);
    scale.power_up();
    delay(400);
    scale.set_scale(1.0f);
    if (!scale.wait_ready_timeout(3000)) {
      lcd.clear();
      lcd.setCursor(0, 0); lcd_print_padded(lcd, "HX711 zavis!    ");
      lcd.setCursor(0, 1); lcd_print_padded(lcd, "Proverte provod!");
      { unsigned long _t0=millis(); while(millis()-_t0<2000UL){app_wdt_reset();yield();} }
      sys.needsRedraw = true; lastActivityTime = millis();
      return;
    }
  }
  // Ручной tare с yield — вместо блокирующего scale.tare(10)
  {
    long sum = 0;
    const int TARE_SAMPLES = 10;
    for (int i = 0; i < TARE_SAMPLES; i++) {
      scale.wait_ready_timeout(500);
      sum += scale.read();
      app_wdt_reset();
      yield();
    }
    scale.set_offset(sum / TARE_SAMPLES);
  }
  long zeroOffset = scale.get_offset();
  Serial.print(F("[Calib] zero offset=")); Serial.println(zeroOffset);

  lcd.clear();
  lcd.setCursor(0, 0); lcd_print_padded(lcd, "Polozh. 1 kg    ");
  lcd.setCursor(0, 1); lcd_print_padded(lcd, "Zhmi knopku...  ");
  if (!wait_press(BUTTON_PIN, 30000)) { sys.needsRedraw = true; lastActivityTime = millis(); return; }

  // Пауза 1.5 сек — дать грузу стабилизироваться
  lcd.clear();
  lcd.setCursor(0, 0); lcd_print_padded(lcd, "Kalibrovka...   ");
  { unsigned long _t=millis(); while(millis()-_t<1500UL){app_wdt_reset();yield();} }

  if (!scale.wait_ready_timeout(3000)) {
    lcd.clear();
    lcd.setCursor(0, 0); lcd_print_padded(lcd, "OSHIBKA HX711!  ");
    lcd.setCursor(0, 1); lcd_print_padded(lcd, "Povtorite       ");
    { unsigned long _t0=millis(); while(millis()-_t0<2000UL){app_wdt_reset();yield();} }
    sys.needsRedraw = true; lastActivityTime = millis();
    return;
  }

